[Building_Frost.A_frost_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在此城镇建造新建筑的选项。\n每天提供 500 %ICON_GOLD 黄金。"

[Building_Frost.A_Frost_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[Building_Frost.A_frost_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[Building_Frost.A_frost_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[Building_Frost.A_frost_Fortifications_Level1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产守备部队，直至守备上限"

[Building_Frost.A_frost_Fortifications_Level2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大守备规模\n增加增长率"

[Building_Frost.A_frost_Fortifications_Level3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大守备规模\n降低增长率"

[Building_Frost.A_frost_tower_defence H7TownTower]
mName="寒冰瞭望塔"
mDesc="在攻城战中为城镇提供 2 座箭塔。\n为防守方军队中的单位增加 +10 %ICON_ATTACK 和 +15 %ICON_DEFENSE。"

[Building_Frost.A_frost_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供 7 个随机的 1 级法术。\n它们会授予所有符合要求的来访英雄。"

[Building_Frost.A_frost_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供 6 个随机的 2 级法术。\n它们会授予所有符合要求的来访英雄。"

[Building_Frost.A_frost_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供 4 个随机的 3 级法术。\n它们会授予所有符合要求的来访英雄。"

[Building_Frost.A_frost_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供 2 个随机的 4 级法术。\n它们会授予所有符合要求的来访英雄。"

[Building_Frost.A_frost_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="允许招募英雄，包括新英雄和战败的英雄。新英雄的选择在每周开始时更换。"

[Building_Frost.A_froste_buil_t1_base H7TownDwelling]
mName="飞空艇"
mDesc="核心生物住所。\n允许招募守护者，每周增长 20。"

[Building_Frost.A_frost_t1_upragatel H7TownDwelling]
mName="指挥舰"
mDesc="核心生物住所升级。\n允许招募并将守护者升级为雪地战士。\n（基础增长：20/周）"

[Building_Frost.A_frost_t1_bonus_growth H7TownGrowthEnhancer]
mName="天际艇"
mDesc="核心生物住所升级。\n每周 +10 守护者或雪地战士。"

[Building_Frost.A_frost_t2_basel H7TownDwelling]
mName="寒霜靶场"
mDesc="核心生物住所。\n允许招募流亡者，每周增长 18。"

[Building_Frost.A_frost_t2_upragate H7TownDwelling]
mName="冰冻靶场"
mDesc="核心生物住所升级。\n允许招募并将流亡者升级为寒冰游侠。\n（基础增长：18/周）"

[Building_Frost.A_frost_t2_growth_bonus H7TownGrowthEnhancer]
mName="冰霜训练场"
mDesc="核心生物住所升级。\n每周 +9 流亡者或寒冰游侠。"

[Building_Frost.A_frost_base_t3 H7TownDwelling]
mName="雪冠山丘"
mDesc="核心生物住所。\n允许招募树胡，每周增长 8。"

[Building_Frost.A_frost_upragate_t3 H7TownDwelling]
mName="永恒冰川"
mDesc="核心生物住所升级。\n允许招募并将树胡升级为树胡守望者。\n（基础增长：8/周）"

[Building_Frost.A_frost_t3_grothw_bonus H7TownGrowthEnhancer]
mName="无尽雪原"
mDesc="核心生物住所升级。\n每周 +6 树胡或树胡守望者。"

[Building_Frost.A_frost_t4_base H7TownDwelling]
mName="利刃神殿"
mDesc="精英生物住所。\n允许招募刹帝利，每周增长 6。"

[Building_Frost.A_frost_t4_upragate H7TownDwelling]
mName="冰河洞穴"
mDesc="精英生物住所升级。\n允许招募并将刹帝利升级为刹帝利·迦梨。\n（基础增长：6/周）"

[Building_Frost.A_frost_t4_grothw_bonus H7TownGrowthEnhancer]
mName="持刃者雕像"
mDesc="精英生物住所升级。\n每周 +5 刹帝利或刹帝利·迦梨。"

[Building_Frost.A_frost_t5_base H7TownDwelling]
mName="知识之塔"
mDesc="精英生物住所。\n允许招募学者，每周增长 5。"

[Building_Frost.A_frost_t5_upragate H7TownDwelling]
mName="智慧之塔"
mDesc="精英生物住所升级。\n允许招募并将学者升级为巫师导师。\n（基础增长：5/周）"

[Building_Frost.A_frost_t5_bonus_grothw H7TownGrowthEnhancer]
mName="心智之塔"
mDesc="精英生物住所升级。\n每周 +4 学者或巫师导师。"

[Building_Frost.A_frost_t6_base H7TownDwelling]
mName="西来之云"
mDesc="精英生物住所。\n允许招募风暴骑士，每周增长 2。"

[Building_Frost.A_frost_t6_upragate H7TownDwelling]
mName="风暴之云"
mDesc="精英生物住所升级。\n允许招募并将风暴骑士升级为暴雪骑士。\n（基础增长：2/周）"

[Building_Frost.A_Frost__t6_bonus_production H7TownGrowthEnhancer]
mName="闪电之云"
mDesc="精英生物住所升级。\n风暴骑士或暴雪骑士增长 +2。"

[Building_Frost.A_frost_t7-1_base H7TownDwelling]
mName="霜寒神殿"
mDesc="冠军生物住所。\n允许招募毁灭者，每周增长 2。"

[Building_Frost.A_frost_t7_1_upragate H7TownDwelling]
mName="绝对冻结神殿"
mDesc="冠军生物住所升级。\n允许招募并将毁灭者升级为撼山者。\n（基础增长：2/周）"

[Building_Frost.A_frost_t7-2 H7TownDwelling]
mName="龙之山脉"
mDesc="冠军生物住所。\n允许招募蓝龙，每周增长 2。"

[Building_Frost.A_frost_t7-2_upragate H7TownDwelling]
mName="龙之峰顶"
mDesc="冠军生物住所升级。\n允许招募并将蓝龙升级为冰龙。\n（基础增长：2/周）"

[Building_Frost.A_frost_chambre_des_phoenix_du_gel H7TownDwelling]
mName="霜冻之巢"
mDesc="冠军生物住所。\n允许招募霜鸟。\n可以使用“全部招募”功能招募\n（基础增长：1/周）"

[Building_Frost.A_frost_chambre_des_beast H7TownDwelling]
mName="寒霜法阵"
mDesc="精英生物住所。\n允许招募寒冰巨兽。\n可以使用“全部招募”功能招募\n（基础增长：4/周）"

[Building_Frost.A_frost_warfarrecru H7TownUtilityUnitDwelling]
mName="工作进行中"
mDesc="战争单位生产。\n提供购买第二个战争单位的选项。"

[Building_Frost.A_frost_machine_war H7TownUtilityUnitDwelling]
mName="寒冰工坊"
mDesc="战争单位生产。\n提供购买寒冰魔像的选项"

[Building_Frost.A_frost_Ecurie H7TownHallOfIntrigue]
mName="观星台"
mDesc="来访英雄获得 +5 移动力，持续至本周结束。"

[Building_Frost.A_frost_HallOfIntrigue H7TownHallOfIntrigue]
mName="观测塔"
mDesc="来访英雄获得 +5 移动力，持续至本周结束。"

[Building_Frost.A_frost_fonderie H7TownHallOfIntrigue]
mName="冰冻宝库"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[Building_Frost.A_frost_OverlookTower H7TownBuilding]
mName="寒冰祝福"
mDesc="来访英雄在接下来的 3 场战斗中获得 +10 %icon_initiative 主动性。"

[Building_Frost.Test H7TownBuilding]
mName="炼金实验室"
mDesc="每天提供 1 %icon_Starsilver 星银。"

[Building_Frost.A_frost_SoulvenomCrucible H7TownBuilding]
mName="知识之泉"
mDesc="来访英雄在本周结束前获得 20% 经验值加成。"

[Building_Frost.A_frost_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="为所有访问此城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄能够返回此城镇（如果它是最近的可用城镇）。"

[Building_Frost.A_frost_ShadowsteelRefinery H7TownBuilding]
mName="冰矿精炼厂"
mDesc="每天提供 1 %icon_Crystal Dragon Blood Crystal 龙血水晶。"

[Building_Frost.A_frost_Mine_prod H7TownBuilding]
mName="高地林间空地"
mDesc="每天提供 2 %icon_Wood 木材。"

[Building_Frost.A_frost_ThievesGuild H7TownThiefGuild]
mName="盗贼行会"
mDesc="提供支付费用获取对手信息的选项。"

[Ability_building.A_xp_buff H7BaseBuff]
mName="知识之泉"
mTooltip="该英雄在本周结束前额外获得 %stat1 %stat1.icon。"

[Building_Frost.A_frost_bridge H7TownBuilding]
mName="宝石洞穴"
mDesc="每天提供 2 %icon_Wood 木材。"

[Building_Frost.A_frost_Marketplace H7TownMarketplace]
mName="市场"
mDesc="提供交易资源的选项。"

[Building_Frost.A_frost_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。"

[Building_Frost.A_frost_Ice_Bridge H7TownBuilding]
mName="锈蚀之剑"
mDesc="在战斗的前 3 个回合中，降低敌方军事单位和敌方人造生物 20% 的最大生命值。"

[Building_Frost.A_frost_MarkOfMalassa H7TownTearOfAsha]
mName="亚莎之眷顾"
mDesc="每天提供 5000 %ICON_GOLD 黄金，并增加此城镇的生物增长率 50%。\n间谍可以破坏和掠夺两个额外目标。"

[Ability_building.A_epee_de_rouille_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="锈蚀之剑"
mTooltip="战斗开始时，敌方人造单位和军事单位的最大生命值降低 %buff1.buff.stat %icon_health，持续 %buff1.buff.durini 回合。"

[Ability_building.A_epee_rouille_BuffHero H7BaseBuff]
mName="锈蚀之剑"
mTooltip="战斗开始时降低敌方军事单位和敌方人造生物 20% 的最大生命值。"

[Ability_building.A_HeroAttack_Water_rouille H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="锈蚀之剑"
mTooltip="战斗开始时，敌方人造单位和军事单位的最大生命值降低 %buff1.buff.stat %icon_health，持续 %buff1.buff.durini 回合。"

[Ability_building.A_StoneOfEnlightenment_test H7PermanentBonusSite]
mName=""

[Frost_Town.A_frost_TownLv1 H7Town]
mName=""

[Frost_Town.A_frost_TownLv1_test H7Town]
mName=""

[Heroes_test.A_Frost_Might_Balanced H7HeroClass]
mName="炼金术士"

[Heroes_test.A_graam H7EditorHero]
mName=""
mLore=""

[Ability_building.A_Xp_gain_Ability_Week1 H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="税务官"
mTooltip="第一周提供 500 %special.icon 黄金，从第二周开始每周提供 1000 %special.icon 黄金，每周可收集一次。"

[sahra.A_Creature_ice_angel H7Creature]
mName="天界兵"
mLore="天界兵是炽天使中的冠军。它们的命名常常是上古战争期间陨落的传奇天使的名字，这并非巧合……天界兵在战斗中技艺极其精湛，以绝对的英雄主义和无畏精神作战。但它们也利用对光明的掌握来治疗盟友，甚至将它们从死亡边缘拉回。"

[sahra.A_Army_ice_angel H7AdventureArmy]
mName=""

[Faction.H7Faction_frost H7Faction]
mFactionName="高塔"
mFactionFortName="高塔要塞"
mFactionArmyName="高塔军队 %number"

[Faction.A_Lore_FactionFrost H7GeneralLoreEntry]
mName="高塔"
mText="在七龙历 104 年，\n萨·巴伦勋爵命令龙骑士组建一个秘密组织，从世间隐退以监视恶魔活动。\n在最伟大的法师们陪伴下，他们出发前往格里姆海姆王国冰冻山脉的最高峰，居住在山下的矮人们对此一无所知。\n亚山与矮人之间缺乏联系，不清楚他们在过去的几个世纪里是否有过任何接触，甚至他们的存在是否被矮人侦测到。\n他们建立了一个由自己规则统治的王国，与世隔绝，并学会了与冰霜的生物和灵和谐共处。\n然后，高塔阵营 discreetly 监视着世界。\n他们在第一次月蚀结束时重新出现，修复了恶魔的地狱监狱，然后再次消失。\n在第三次月蚀期间，他们与一个极其强大的恶魔集团进行了一场秘密战争。\n但在第六次月蚀期间，感觉到世界和恶魔活动达到顶峰，他们结束了隐居，出来保护狮鹫王国……\n凭借他们强大的骑兵和空前强大的法师，他们向恶魔发起了猛攻。"

_______________________________
Heroes_7.5 version 1.30 :

version 1.35 :

Corrected the effect of the Rust Sword building to enable to effect to work

v1.37

Corrected Tower descrpition to explain defender stat gains
Made many corrections and tweaks to make descriptions across castles be more consistent and correct